let alphabet = ["а", "б", "в", "г", "д", "е", "ж", "з","и", "й", "к", "л", "м", "н", "о", "п", "р", "с", "т", "у", "ф", "х", "ц", "ч", "ш", "щ", "ъ", "ы", "ь", "э", "ю", "я", ",", ".", " "]
let num = ["42", "19", "67", "23", "91", "55", "38", "72", "514", "209", "64", "37", "5", "736", "14", "8", "83", "6", "52", "88", "127", "9", "888", "74", "7", "46", "92", "115", "107", "3", "8", "5", "13", "16", "18", "603"]
let text = "«самое важное в жизни — это не переставать задавать вопросы"

let crash = text.split("");

let result = "";

for(let i = 0; i < crash.length; i++) {
    for(let j = 0; j < alphabet.length; j++){
        if(crash[i] == alphabet[j]){
            result += num[j] + " ";
        }
    }
}

console.log(result)